Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: وما أدراك ما القارعة
en: And what can make you know what is the Striking Calamity?

source: يوم يكون الناس كالفراش المبثوث
en: It is the Day when people will be like moths, dispersed,

source: وتكون الجبال كالعهن المنفوش
en: And the mountains will be like wool, fluffed up.

source: فأما من ثقلت موازينه
en: Then as for one whose scales are heavy [with good deeds],

source: وأما من خفت موازينه
en: But as for one whose scales are light,

source: فأمه هاوية
en: His refuge will be an abyss.

source: وما أدراك ما هيه
en: And what can make you know what that is?

source: نار حامية
en: It is a Fire, intensely hot.

source: ألهاكم التكاثر
en: Competition in [worldly] increase diverts you

source: حتى زرتم المقابر
en: Until you visit the graveyards.

source: كلا سوف تعلمون
en: No! You are going to know.

source: ثم كلا سوف تعلمون
en: Then no! You are going to know.

source: كلا لو تعلمون علم اليقين
en: No! If you only knew with knowledge of certainty...

source: لترون الجحيم
en: You will surely see the Hellfire.

source: ثم لترونها عين اليقين
en: Then you will surely see it with the eye of certainty.

source: ثم لتسألن يومئذ عن النعيم
en: Then you will surely be asked that Day about pleasure.

source: والعصر
en: By time,

source: إن الإنسان لفي خسر
en: Indeed, mankind is in loss,

source: إلا الذين آمنوا وعملوا الصالحات وتواصوا بالحق وتواصوا بالصبر
en: Except for those who have believed and done righteous deeds and advised each other to truth and advised each other to patience.

source: ويل لكل همزة لمزة
en: Woe to every scorner and mocker

source: الذي جمع مالا وعدده
en: Who collects wealth and [continuously] counts it.

source: يحسب أن ماله أخلده
en: He thinks that his wealth will make him immortal.

source: كلا لينبذن في الحطمة
en: No! He will surely be thrown into the Crusher.

source: وما أدراك ما الحطمة
en: And what can make you know what is the Crusher?

source: نار الله الموقدة
en: It is the fire of Allah, [eternally] fueled,

source: التي تطلع على الأفئدة
en: Which mounts directed at the hearts.

source: إنها عليهم مؤصدة
en: Indeed, Hellfire will be closed down upon them

source: في عمد ممددة
en: In extended columns.

source: ألم تر كيف فعل ربك بأصحاب الفيل
en: Have you not considered, [O Muhammad], how your Lord dealt with the companions of the elephant?

source: ألم يجعل كيدهم في تضليل
en: Did He not make their plan into misguidance?

source: وأرسل عليهم طيرا أبابيل
en: And He sent against them birds in flocks,

source: ترميهم بحجارة من سجيل
en: Striking them with stones of hard clay,

source: فجعلهم كعصف مأكول
en: And He made them like eaten straw.

source: لإيلاف قريش
en: For the accustomed security of the Quraysh -

source: إيلافهم رحلة الشتاء والصيف
en: Their accustomed security [in] the caravan of winter and summer -

source: فليعبدوا رب هذا البيت
en: Let them worship the Lord of this House,

source: الذي أطعمهم من جوع وآمنهم من خوف
en: Who has fed them, [saving them] from hunger and made them safe, [saving them] from fear.

source: أرأيت الذي يكذب بالدين
en: Have you seen the one who denies the Recompense?

source: فذلك الذي يدع اليتيم
en: For that is the one who drives away the orphan

source: فويل للمصلين
en: So woe to those who pray

source: الذين هم عن صلاتهم ساهون
en: [But] who are heedless of their prayer -

source: الذين هم يراءون
en: Those who make show [of their deeds]

source: ويمنعون الماعون
en: And withhold [simple] assistance.

source: إنا أعطيناك الكوثر
en: Indeed, We have granted you, [O Muhammad], al-Kawthar.

source: فصل لربك وانحر
en: So pray to your Lord and sacrifice [to Him alone].

source: إن شانئك هو الأبتر
en: Indeed, your enemy is the one cut off.

source: قل يا أيها الكافرون
en: Say, "O disbelievers,

source: لا أعبد ما تعبدون
en: I do not worship what you worship.

source: ولا أنتم عابدون ما أعبد
en: Nor are you worshippers of what I worship.

source: ولا أنا عابد ما عبدتم
en: Nor will I be a worshipper of what you worship.

source: لكم دينكم ولي دين
en: For you is your religion, and for me is my religion."

source: إذا جاء نصر الله والفتح
en: When the victory of Allah has come and the conquest,

source: ورأيت الناس يدخلون في دين الله أفواجا
en: And you see the people entering into the religion of Allah in multitudes,

source: فسبح بحمد ربك واستغفره إنه كان توابا
en: Then exalt [Him] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance.

source: تبت يدا أبي لهب وتب
en: May the hands of Abu Lahab be ruined, and ruined is he.

source: ما أغنى عنه ماله وما كسب
en: His wealth will not avail him or that which he gained.

source: سيصلى نارا ذات لهب
en: He will [enter to] burn in a Fire of [blazing] flame

source: وامرأته حمالة الحطب
en: And his wife [as well] - the carrier of firewood.

source: في جيدها حبل من مسد
en: Around her neck is a rope of [twisted] fiber.

source: قل هو الله أحد
en: Say, "He is Allah, [who is] One,

source: الله الصمد
en: Allah, the Eternal Refuge.

source: لم يلد ولم يولد
en: He neither begets nor is born,

source: ولم يكن له كفوا أحد
en: Nor is there to Him any equivalent."

source: قل أعوذ برب الفلق
en: Say, "I seek refuge in the Lord of daybreak

source: من شر ما خلق
en: From the evil of that which He created

source: ومن شر غاسق إذا وقب
en: And from the evil of darkness when it settles

source: ومن شر النفاثات في العقد
en: And from the evil of the blowers in knots

source: ومن شر حاسد إذا حسد
en: And from the evil of an envier when he envies."

source: قل أعوذ برب الناس
en: Say, "I seek refuge in the Lord of mankind,

source: ملك الناس
en: The Sovereign of mankind.

source: إله الناس
en: The God of mankind,

source: من شر الوسواس الخناس
en: From the evil of the retreating whisperer -

source: الذي يوسوس في صدور الناس
en: Who whispers [evil] into the breasts of mankind -

source: من الجنة والناس
en: From among the jinn and mankind."
